app/views/enums/new.html.erb

    Система <br>
    <%= f.collection_select(:system_id,  System.all.order(:name), :id, :name, prompt: true)%>
---
SELECT "systems".* FROM "systems" ORDER BY "systems"."name" ASC