app/views/devise/registrations/new.html.erb

    <%= f.label :country %><br>
    <%= f.collection_select(:country_id,  Country.all.order(:state), :id, :state, prompt: true) %>
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."state" ASC