app/admin/enums.rb

SELECT "systems".* FROM "systems"
---
      f.input :kind
    end
    f.inputs 'System' do
      f.input :system_id, :as => :select, :collection => System.all