app/admin/enum_converts.rb

SELECT "enums".* FROM "enums"
---
  actions :all
  form do |f|
    f.inputs 'From' do
      f.input :enum_from_id, :as => :select, :collection => Enum.all
    end

    f.inputs 'to' do
      f.input :enum_to_id, :as => :select, :collection => Enum.all