app/admin/recipes.rb

SELECT "enums".* FROM "enums"
---
                   new_record: true do |a|
          a.input :name_in
          a.input :amount_in
          a.input :enum_id, :as => :select, :collection => Enum.all