app/views/recipes/_edit_new.html.slim

-@translate_des="Описание"
-@country_name=Country.find(current_user.country_id).state
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]