app/views/recipes/edit.html.erb

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <%
      system_id=Country.find(current_user.country_id).system_id

SELECT "enums".* FROM "enums" WHERE "enums"."system_id" = ?  [["system_id", 2]]
---
    %>
    <%= form.collection_select(:enum_id, Enum.where("system_id = ? or system_id=?", system_id, 3), :id, :short, prompt: false) %>