app/views/recipes/edit.html.slim

SELECT "enums".* FROM "enums" WHERE (system_id = 1 or system_id=3)
---
        -system_id=Country.find(current_user.country_id).system_id
        = form.collection_select(:enum_id, Enum.where("system_id = ? or system_id=?", system_id, 3), :id, :short, prompt: false)