app/views/recipes/edit.html.erb

    <%= form.text_field :amount_in %>
    <%= form.collection_select(:enum_id, Enum.all, :id, :name, prompt: false) %>
---
SELECT "enums".* FROM "enums"