app/views/recipes/edit.html.slim

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  - @translate_otmena = 'Отмена'
  - @country_name =Country.find(current_user.country_id).state

SELECT "ingrs".* FROM "ingrs" WHERE "ingrs"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  table
    - @recipe.ingrs.each do |i|
      -system_to_id = Country.find(current_user.country_id).system_id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      - @translate_del = 'Удалить'
      - @country_name =Country.find(current_user.country_id).state

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      - else
        - @recipe_user = Country.find(@recipe.user_id).id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
       td width='100px'
        -system_id=Country.find(current_user.country_id).system_id
        - @country_name =Country.find(current_user.country_id).state

SELECT "enums".* FROM "enums" WHERE (system_id = 2 or system_id=3)
SELECT "enums".* FROM "enums" WHERE (system_id = 1 or system_id=3)
---
        - if @country_name != 'Россия'
           = form.collection_select(:enum_id, Enum.where("system_id = ? or system_id=?", system_id, 3), :id, :translated_name, prompt: false)
        - else
          = form.collection_select(:enum_id, Enum.where("system_id = ? or system_id=?", system_id, 3), :id, :name, prompt: false)