app/views/recipes/index.html.slim

     - @translate_rec=r.name
     - @country_name =Country.find(current_user.country_id).state
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]