app/views/recipes/new.html.slim

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
- @translate_add_recipe = 'Добавить рецепт'
- @country_name =Country.find(current_user.country_id).state

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  - @translate_add_ingr = 'Добавить ингредиент'
  - @country_name =Country.find(current_user.country_id).state

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  -@translate_submit="Запомнить"
  -@country_name=Country.find(current_user.country_id).state