app/views/recipes/show.html.slim

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
- @translate_rec=@recipe.name
- @country_name =Country.find(current_user.country_id).state

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
- else
  - @recipe_user = Country.find(@recipe.user_id).id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
- @translate_ingr = 'Ингредиенты'
- @country_name =Country.find(current_user.country_id).state

SELECT "ingrs".* FROM "ingrs" WHERE "ingrs"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
table
  - @recipe.ingrs.each do |i|
    p
       - system_to_id = Country.find(current_user.country_id).system_id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    -@translate_enum = enum_name
    - @country_name =Country.find(current_user.country_id).state

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    - else
      - @recipe_user = Country.find(@recipe.user_id).id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  - @translate_otmena = 'Отмена'
  - @country_name =Country.find(current_user.country_id).state

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  - else
    - @recipe_user = Country.find(@recipe.user_id).id

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 2]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

- @recipe.comments.each do |comment|
  - @translate_comment = comment.body
  - @country_name =Country.find(current_user.country_id).state

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  - else
     - @recipe_user = Country.find(@recipe.user_id).id

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
- @translate_add = 'Добавить комментарий'
- @country_name =Country.find(current_user.country_id).state