app/views/recipes/show.html.erb

SELECT "ingrs".* FROM "ingrs" WHERE "ingrs"."recipe_id" = ?  [["recipe_id", 2]]
---
<h2>Ingredients</h2>
<% @recipe.ingrs.each do |i| %>

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "enums".* FROM "enums" WHERE "enums"."system_id" = ? LIMIT ?  [["system_id", 2], ["LIMIT", 1]]
SELECT "enum_converts".* FROM "enum_converts" WHERE "enum_converts"."enum_from_id" = ? AND "enum_converts"."enum_to_id" = ? LIMIT ?  [["enum_from_id", 1], ["enum_to_id", 3], ["LIMIT", 1]]
---
      @s=current_user.country_id
      @c=Country.find_by(id: @s).system_id
      @r=User.find_by(id: @recipe.user_id).country_id
      @rr=Country.find_by(id: @r).system_id
      @e = i.enum.id
      @i=Enum.find_by(system_id: @c).id
      if (@c!=@rr)
        @en=EnumConvert.find_by(enum_from: @e, enum_to: @i).enum_to.name
        @amount=EnumConvert.find_by(enum_from: @e, enum_to: @i).ratio

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 2]]
---
<h2>Comments</h2>
<% @recipe.comments.each do |comment| %>