app/views/recipes/show.html.slim


- @recipe.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 1]]