app/views/recipes/show.html.erb

<h2><i class="fa fa-comments"></i>Comments</h2>
<% @recipe.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 3]]