app/views/countries/index.html.erb

<% @countries.each do |r| %>
  <p> <%= link_to r.country, country_path(r) %></p>
---
SELECT "countries".* FROM "countries"