app/views/enum_converts/new.html.erb

SELECT "enums".* FROM "enums" ORDER BY "enums"."name" ASC
---
    из <br>
    <%= f.collection_select(:enum_from_id,  Enum.all.order(:name), :id, :name, prompt: true)%>

SELECT "enums".* FROM "enums" ORDER BY "enums"."name" ASC
---
    в <br>
    <%= f.collection_select(:enum_to_id,  Enum.all.order(:name), :id, :name, prompt: true)%>