app/controllers/comments_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["body", "Great!"], ["recipe_id", 1], ["created_at", "2020-12-27 20:37:16.162250"], ["updated_at", "2020-12-27 20:37:16.162250"]]
---
  def create
    #render plain: params[:comment].inspect
     @recipe=Recipe.find(params[:recipe_id])
    #render plain: @recipe.inspect
     @comment=@recipe.comments.create(comment_params)