app/controllers/countries_controller.rb

  def show
    @country=Country.find(params[:id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @country=Country.new(countries_params)
    if (@country.save)
---
INSERT INTO "countries" ("country", "system_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["country", "Россия"], ["system_id", 1], ["created_at", "2020-12-21 14:37:44.608103"], ["updated_at", "2020-12-21 14:37:44.608103"]]

  def edit
    @country=Country.find(params[:id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @country=Country.find(params[:id])
    if (@country.update(countries_params))
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "countries" SET "system_id" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["system_id", 2], ["updated_at", "2020-12-04 12:53:10.541276"], ["id", 3]]

  def destroy
    @country=Country.find(params[:id])
    @country.destroy
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 1]]