app/controllers/enum_converts_controller.rb

SELECT "enum_converts".* FROM "enum_converts"
---
  def index
    @enum_converts=EnumConvert.all

INSERT INTO "enum_converts" ("enum_from_id", "enum_to_id", "ratio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["enum_from_id", 2], ["enum_to_id", 3], ["ratio", 2.2], ["created_at", "2020-12-11 12:29:56.337795"], ["updated_at", "2020-12-11 12:29:56.337795"]]
---
  def create
    @enum_convert=EnumConvert.new(convert_params)
    if (@enum_convert.save)