app/controllers/enums_controller.rb

SELECT "enums".* FROM "enums"
---
    def index
      @enums=Enum.all

INSERT INTO "enums" ("name", "short", "kind", "system_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "грамм"], ["short", "г."], ["kind", "вес"], ["system_id", 2], ["created_at", "2020-12-11 12:19:06.453770"], ["updated_at", "2020-12-11 12:19:06.453770"]]
---
    def create
      @enum=Enum.new(enums_params)
      if (@enum.save)