app/controllers/ingrs_controller.rb

  def create
    # render plain: params[:ingr].inspect
    @recipe = Recipe.find(params[:recipe_id])
    @ingr = @recipe.ingrs.create(ingredient_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "ingrs" ("recipe_id", "name_in", "amount_in", "enum_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 1], ["name_in", "Морковь"], ["amount_in", "100.0"], ["enum_id", 1], ["created_at", "2020-12-21 18:36:35.528899"], ["updated_at", "2020-12-21 18:36:35.528899"]]

  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    @recipe.ingrs.find(params[:id]).destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "ingrs" WHERE "ingrs"."id" = $1  [["id", 1]]
SELECT "ingrs".* FROM "ingrs" WHERE "ingrs"."recipe_id" = $1 AND "ingrs"."id" = $2 LIMIT $3  [["recipe_id", 1], ["id", 1], ["LIMIT", 1]]