app/controllers/recipes_controller.rb

  def create
    #№render plain: params[:recipe].inspect
    @recipe=Recipe.new(rec_params);

    if (@recipe.save)
---
INSERT INTO "recipes" ("name", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Рецепт"], ["body", "..."], ["created_at", "2020-12-29 10:14:24.473655"], ["updated_at", "2020-12-29 10:14:24.473655"], ["user_id", 4]]

  def update
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]