app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Жареная картошка"], ["body", "nn"], ["user_id", 1], ["created_at", "2020-12-12 09:01:17.645643"], ["updated_at", "2020-12-12 09:01:17.645643"]]
---
  def create
    #№render plain: params[:recipe].inspect
    @recipe=Recipe.new(rec_params);

    if (@recipe.save)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "body" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Мясо"], ["body", "Мясо"], ["updated_at", "2020-12-19 20:23:05.180995"], ["id", 3]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if(@recipe.update(rec_params))