app/controllers/systems_controller.rb

  def index
    @systems=System.all
---
SELECT "systems".* FROM "systems"

  def show
     @system=System.find(params[:id])
---
SELECT "systems".* FROM "systems" WHERE "systems"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @system=System.new(system_params)
    if (@system.save)
---
INSERT INTO "systems" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Метрическая"], ["created_at", "2020-12-03 18:54:53.748914"], ["updated_at", "2020-12-03 18:54:53.748914"]]

  def edit
    @system=System.find(params[:id])
---
SELECT "systems".* FROM "systems" WHERE "systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @system=System.find(params[:id])
    if (@system.update(system_params))
---
SELECT "systems".* FROM "systems" WHERE "systems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "systems" SET "name" = ?, "updated_at" = ? WHERE "systems"."id" = ?  [["name", "Англий"], ["updated_at", "2020-12-03 19:26:50.951572"], ["id", 3]]

  def destroy
    @system=System.find(params[:id])
    @system.destroy
---
SELECT "systems".* FROM "systems" WHERE "systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "systems" WHERE "systems"."id" = ?  [["id", 1]]