app/models/enum_convert.rb

SELECT "enums".* FROM "enums" WHERE "enums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "enum_converts".* FROM "enum_converts" WHERE (enum_from_id=1 and enum_to_id in (select id from enums where system_id=2))
SELECT "enums".* FROM "enums" WHERE "enums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "enum_converts".* FROM "enum_converts" WHERE (enum_to_id=1 and enum_from_id in (select id from enums where system_id=2))
---
  def self.do_convert(enum_from, enum_system_to_id, value)
    enum_name = enum_from.name
    system_from_id = enum_from.system_id

    # Если используется одна система единиц, возвращаем исходные значения
    if system_from_id == enum_system_to_id
      return value, enum_name, nil
    end
    # Выбираем прямые преобразования
    converts = Array.new
    EnumConvert.where('enum_from_id=? and enum_to_id in (select id from enums where system_id=?)', enum_from.id,enum_system_to_id).each do |u|
      converts.push( {ratio: u.ratio, enum_name: u.enum_to.name } )
    end
    # Добавляем обратные преобразования
    EnumConvert.where('enum_to_id=? and enum_from_id in (select id from enums where system_id=?)', enum_from.id,enum_system_to_id).each do |u|